app/views/topics/_topic.html.erb

  <p> <%= topic.description %> </p>
  <p> <%= pluralize(topic.pages.all.count, "page") %></p>
---
SELECT "pages".* FROM "pages" WHERE "pages"."topic_id" = 4