app/views/sections/_section.html.erb

  <p><%= section.name %> </p>
  <p> <%= pluralize(section.topics.all.count, "chapter") %> </p>
---
SELECT "topics".* FROM "topics" WHERE "topics"."section_id" = 1