app/controllers/library_controller.rb

def show
  @sections = Section.all
---
SELECT "sections".* FROM "sections"