app/controllers/pages_controller.rb

INSERT INTO "pages" ("created_at", "html", "name", "topic_id", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @page = Page.create(params[:page])