app/controllers/topics_controller.rb

  def show
    #@section = Section.find(params[:id])
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @topic = Topic.create(params[:topic])
---
INSERT INTO "topics" ("created_at", "description", "name", "section_id", "updated_at") VALUES (?, ?, ?, ?, ?)